http/server/latency_all.log
Running Tests: Bare Metal
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   6142      0 --:--:-- --:--:-- --:--:--  6142
hello:broot:/:hello:bbranch:/:hello:bleaf:/
Summary:
  Total:	10.0011 secs
  Slowest:	0.0069 secs
  Fastest:	0.0005 secs
  Average:	0.0012 secs
  Requests/sec:	812.5114
  
  Total data:	349418 bytes
  Size/request:	43 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [2517]	|■■■■■■■■■■■■■■■■■■
  0.002 [5589]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [17]	|
  0.003 [1]	|
  0.004 [0]	|
  0.004 [0]	|
  0.005 [0]	|
  0.006 [0]	|
  0.006 [0]	|
  0.007 [1]	|


Latency distribution:
  10% in 0.0007 secs
  25% in 0.0009 secs
  50% in 0.0013 secs
  75% in 0.0015 secs
  90% in 0.0016 secs
  95% in 0.0016 secs
  99% in 0.0017 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0005 secs, 0.0069 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0011 secs, 0.0004 secs, 0.0067 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	8126 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1861      0 --:--:-- --:--:-- --:--:--  1861
hello:broot:/busywork:hello:bbranch:/busywork:hello:bleaf:/busywork
Summary:
  Total:	10.0064 secs
  Slowest:	0.0332 secs
  Fastest:	0.0317 secs
  Average:	0.0321 secs
  Requests/sec:	31.1800
  
  Total data:	20904 bytes
  Size/request:	67 bytes

Response time histogram:
  0.032 [1]	|
  0.032 [12]	|■■■
  0.032 [105]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [154]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [34]	|■■■■■■■■■
  0.032 [5]	|■
  0.033 [0]	|
  0.033 [0]	|
  0.033 [0]	|
[...]
  0.033 [1]	|


Latency distribution:
  10% in 0.0320 secs
  25% in 0.0320 secs
  50% in 0.0321 secs
  75% in 0.0321 secs
  90% in 0.0322 secs
  95% in 0.0323 secs
  99% in 0.0324 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0317 secs, 0.0332 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0319 secs, 0.0316 secs, 0.0323 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	312 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2521      0 --:--:-- --:--:-- --:--:--  2521
hello:broot:/prime:hello:bbranch:/prime:hello:bleaf:/prime
Summary:
  Total:	10.0057 secs
  Slowest:	0.0199 secs
  Fastest:	0.0150 secs
  Average:	0.0170 secs
  Requests/sec:	58.7663
  
  Total data:	34104 bytes
  Size/request:	58 bytes

Response time histogram:
  0.015 [1]	|
  0.015 [17]	|■■■■■
  0.016 [66]	|■■■■■■■■■■■■■■■■■■■■■
  0.016 [93]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [124]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [104]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.018 [82]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.018 [56]	|■■■■■■■■■■■■■■■■■■
  0.019 [32]	|■■■■■■■■■■
  0.019 [8]	|■■■
  0.020 [5]	|■■


Latency distribution:
  10% in 0.0158 secs
  25% in 0.0163 secs
  50% in 0.0169 secs
  75% in 0.0177 secs
  90% in 0.0183 secs
  95% in 0.0187 secs
  99% in 0.0195 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0150 secs, 0.0199 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0169 secs, 0.0149 secs, 0.0198 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	588 responses



Running Tests: Bare Metal
Concurrency level: 3
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   7166      0 --:--:-- --:--:-- --:--:--  7166
hello:broot:/:hello:bbranch:/:hello:bleaf:/
Summary:
  Total:	10.0014 secs
  Slowest:	0.0032 secs
  Fastest:	0.0005 secs
  Average:	0.0008 secs
  Requests/sec:	3877.4690
  
  Total data:	1667540 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [23952]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [14143]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [669]	|■
  0.002 [10]	|
  0.002 [0]	|
  0.002 [1]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [3]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0007 secs
  25% in 0.0007 secs
  50% in 0.0008 secs
  75% in 0.0008 secs
  90% in 0.0009 secs
  95% in 0.0009 secs
  99% in 0.0011 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0005 secs, 0.0032 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0009 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0007 secs, 0.0005 secs, 0.0028 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	38780 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1861      0 --:--:-- --:--:-- --:--:--  1861
hello:broot:/busywork:hello:bbranch:/busywork:hello:bleaf:/busywork
Summary:
  Total:	10.0198 secs
  Slowest:	0.0421 secs
  Fastest:	0.0312 secs
  Average:	0.0321 secs
  Requests/sec:	93.4146
  
  Total data:	62712 bytes
  Size/request:	67 bytes

Response time histogram:
  0.031 [1]	|
  0.032 [834]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.033 [84]	|■■■■
  0.034 [3]	|
  0.036 [3]	|
  0.037 [4]	|
  0.038 [3]	|
  0.039 [1]	|
  0.040 [2]	|
  0.041 [0]	|
  0.042 [1]	|


Latency distribution:
  10% in 0.0317 secs
  25% in 0.0319 secs
  50% in 0.0320 secs
  75% in 0.0321 secs
  90% in 0.0323 secs
  95% in 0.0325 secs
  99% in 0.0365 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0312 secs, 0.0421 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0320 secs, 0.0311 secs, 0.0420 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	936 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2636      0 --:--:-- --:--:-- --:--:--  2636
hello:broot:/prime:hello:bbranch:/prime:hello:bleaf:/prime
Summary:
  Total:	10.0120 secs
  Slowest:	0.0239 secs
  Fastest:	0.0133 secs
  Average:	0.0162 secs
  Requests/sec:	184.6780
  
  Total data:	107242 bytes
  Size/request:	58 bytes

Response time histogram:
  0.013 [1]	|
  0.014 [57]	|■■■■
  0.015 [517]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [535]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.018 [463]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [176]	|■■■■■■■■■■■■■
  0.020 [75]	|■■■■■■
  0.021 [19]	|■
  0.022 [5]	|
  0.023 [0]	|
  0.024 [1]	|


Latency distribution:
  10% in 0.0148 secs
  25% in 0.0152 secs
  50% in 0.0161 secs
  75% in 0.0170 secs
  90% in 0.0180 secs
  95% in 0.0187 secs
  99% in 0.0200 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0133 secs, 0.0239 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0161 secs, 0.0132 secs, 0.0237 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	1849 responses



Running Tests: Host local containers
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   4777      0 --:--:-- --:--:-- --:--:--  4777
hello:lroot:/:hello:lbranch:/:hello:lleaf:/
Summary:
  Total:	10.0020 secs
  Slowest:	0.0029 secs
  Fastest:	0.0007 secs
  Average:	0.0015 secs
  Requests/sec:	671.8662
  
  Total data:	288960 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [49]	|
  0.001 [112]	|■
  0.001 [1023]	|■■■■■■■■■
  0.002 [4627]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [899]	|■■■■■■■■
  0.002 [8]	|
  0.002 [0]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0013 secs
  25% in 0.0014 secs
  50% in 0.0015 secs
  75% in 0.0016 secs
  90% in 0.0016 secs
  95% in 0.0017 secs
  99% in 0.0017 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.0029 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0014 secs, 0.0007 secs, 0.0019 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	6720 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1810      0 --:--:-- --:--:-- --:--:--  1810
hello:lroot:/busywork:hello:lbranch:/busywork:hello:lleaf:/busywork
Summary:
  Total:	10.0114 secs
  Slowest:	0.0334 secs
  Fastest:	0.0317 secs
  Average:	0.0321 secs
  Requests/sec:	31.1644
  
  Total data:	20904 bytes
  Size/request:	67 bytes

Response time histogram:
  0.032 [1]	|
  0.032 [6]	|■
  0.032 [90]	|■■■■■■■■■■■■■■■■■■■■
  0.032 [181]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [26]	|■■■■■■
  0.033 [7]	|■■
  0.033 [0]	|
  0.033 [0]	|
  0.033 [0]	|
[...]
  0.033 [1]	|


Latency distribution:
  10% in 0.0320 secs
  25% in 0.0320 secs
  50% in 0.0321 secs
  75% in 0.0321 secs
  90% in 0.0322 secs
  95% in 0.0323 secs
  99% in 0.0325 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0317 secs, 0.0334 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0320 secs, 0.0316 secs, 0.0324 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0002 secs

Status code distribution:
  [200]	312 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2230      0 --:--:-- --:--:-- --:--:--  2230
hello:lroot:/prime:hello:lbranch:/prime:hello:lleaf:/prime
Summary:
  Total:	10.0098 secs
  Slowest:	0.0291 secs
  Fastest:	0.0184 secs
  Average:	0.0228 secs
  Requests/sec:	43.8571
  
  Total data:	25462 bytes
  Size/request:	58 bytes

Response time histogram:
  0.018 [1]	|
  0.019 [28]	|■■■■■■■■■■■■
  0.021 [33]	|■■■■■■■■■■■■■■■
  0.022 [68]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [90]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.024 [77]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [59]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [46]	|■■■■■■■■■■■■■■■■■■■■
  0.027 [20]	|■■■■■■■■■
  0.028 [12]	|■■■■■
  0.029 [5]	|■■


Latency distribution:
  10% in 0.0202 secs
  25% in 0.0213 secs
  50% in 0.0227 secs
  75% in 0.0244 secs
  90% in 0.0257 secs
  95% in 0.0267 secs
  99% in 0.0282 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0184 secs, 0.0291 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0227 secs, 0.0182 secs, 0.0290 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [200]	439 responses



Running Tests: Host local containers
Concurrency level: 3
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   7166      0 --:--:-- --:--:-- --:--:--  7166
hello:lroot:/:hello:lbranch:/:hello:lleaf:/
Summary:
  Total:	10.0011 secs
  Slowest:	0.0031 secs
  Fastest:	0.0006 secs
  Average:	0.0008 secs
  Requests/sec:	3798.3949
  
  Total data:	1633484 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [25454]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [11691]	|■■■■■■■■■■■■■■■■■■
  0.001 [814]	|■
  0.002 [16]	|
  0.002 [5]	|
  0.002 [4]	|
  0.002 [1]	|
  0.003 [0]	|
  0.003 [0]	|
  0.003 [2]	|


Latency distribution:
  10% in 0.0007 secs
  25% in 0.0007 secs
  50% in 0.0008 secs
  75% in 0.0008 secs
  90% in 0.0009 secs
  95% in 0.0009 secs
  99% in 0.0011 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.0031 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0007 secs, 0.0005 secs, 0.0022 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	37988 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1810      0 --:--:-- --:--:-- --:--:--  1810
hello:lroot:/busywork:hello:lbranch:/busywork:hello:lleaf:/busywork
Summary:
  Total:	10.0287 secs
  Slowest:	0.0456 secs
  Fastest:	0.0315 secs
  Average:	0.0320 secs
  Requests/sec:	93.5316
  
  Total data:	62846 bytes
  Size/request:	67 bytes

Response time histogram:
  0.031 [1]	|
  0.033 [930]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.034 [1]	|
  0.036 [1]	|
  0.037 [0]	|
  0.039 [2]	|
  0.040 [2]	|
  0.041 [0]	|
  0.043 [0]	|
  0.044 [0]	|
  0.046 [1]	|


Latency distribution:
  10% in 0.0318 secs
  25% in 0.0319 secs
  50% in 0.0320 secs
  75% in 0.0321 secs
  90% in 0.0322 secs
  95% in 0.0323 secs
  99% in 0.0326 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0315 secs, 0.0456 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0319 secs, 0.0314 secs, 0.0455 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	938 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2416      0 --:--:-- --:--:-- --:--:--  2416
hello:lroot:/prime:hello:lbranch:/prime:hello:lleaf:/prime
Summary:
  Total:	10.0148 secs
  Slowest:	0.0335 secs
  Fastest:	0.0171 secs
  Average:	0.0231 secs
  Requests/sec:	129.7085
  
  Total data:	75342 bytes
  Size/request:	58 bytes

Response time histogram:
  0.017 [1]	|
  0.019 [106]	|■■■■■■■■■■■■■■■
  0.020 [180]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.022 [175]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.024 [218]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [290]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.027 [238]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.029 [66]	|■■■■■■■■■
  0.030 [17]	|■■
  0.032 [4]	|■
  0.033 [4]	|■


Latency distribution:
  10% in 0.0189 secs
  25% in 0.0207 secs
  50% in 0.0234 secs
  75% in 0.0253 secs
  90% in 0.0266 secs
  95% in 0.0273 secs
  99% in 0.0296 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0171 secs, 0.0335 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0012 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0230 secs, 0.0170 secs, 0.0334 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	1299 responses



Running Tests: Containers
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   4777      0 --:--:-- --:--:-- --:--:--  4777
hello:croot:/:hello:cbranch:/:hello:cleaf:/
Summary:
  Total:	10.0006 secs
  Slowest:	0.0031 secs
  Fastest:	0.0007 secs
  Average:	0.0017 secs
  Requests/sec:	588.5636
  
  Total data:	253098 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [18]	|
  0.001 [44]	|■
  0.001 [220]	|■■■
  0.002 [2231]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [3222]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [145]	|■■
  0.002 [4]	|
  0.003 [0]	|
  0.003 [0]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0015 secs
  25% in 0.0016 secs
  50% in 0.0017 secs
  75% in 0.0018 secs
  90% in 0.0019 secs
  95% in 0.0019 secs
  99% in 0.0020 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.0031 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0016 secs, 0.0007 secs, 0.0022 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	5886 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1810      0 --:--:-- --:--:-- --:--:--  1810
hello:croot:/busywork:hello:cbranch:/busywork:hello:cleaf:/busywork
Summary:
  Total:	10.0027 secs
  Slowest:	0.0336 secs
  Fastest:	0.0320 secs
  Average:	0.0324 secs
  Requests/sec:	30.8916
  
  Total data:	20703 bytes
  Size/request:	67 bytes

Response time histogram:
  0.032 [1]	|
  0.032 [11]	|■■■
  0.032 [70]	|■■■■■■■■■■■■■■■■■■
  0.032 [160]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.033 [53]	|■■■■■■■■■■■■■
  0.033 [12]	|■■■
  0.033 [1]	|
  0.033 [0]	|
  0.033 [0]	|
  0.033 [0]	|
  0.034 [1]	|


Latency distribution:
  10% in 0.0322 secs
  25% in 0.0323 secs
  50% in 0.0324 secs
  75% in 0.0325 secs
  90% in 0.0325 secs
  95% in 0.0326 secs
  99% in 0.0328 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0320 secs, 0.0336 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0322 secs, 0.0319 secs, 0.0328 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	309 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2320      0 --:--:-- --:--:-- --:--:--  2320
hello:croot:/prime:hello:cbranch:/prime:hello:cleaf:/prime
Summary:
  Total:	10.0225 secs
  Slowest:	0.0284 secs
  Fastest:	0.0176 secs
  Average:	0.0231 secs
  Requests/sec:	43.2030
  
  Total data:	25114 bytes
  Size/request:	58 bytes

Response time histogram:
  0.018 [1]	|■
  0.019 [3]	|■■
  0.020 [25]	|■■■■■■■■■■■■■■
  0.021 [41]	|■■■■■■■■■■■■■■■■■■■■■■
  0.022 [71]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [70]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.024 [74]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [66]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [40]	|■■■■■■■■■■■■■■■■■■■■■■
  0.027 [33]	|■■■■■■■■■■■■■■■■■■
  0.028 [9]	|■■■■■


Latency distribution:
  10% in 0.0203 secs
  25% in 0.0216 secs
  50% in 0.0231 secs
  75% in 0.0247 secs
  90% in 0.0262 secs
  95% in 0.0271 secs
  99% in 0.0276 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0176 secs, 0.0284 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0230 secs, 0.0175 secs, 0.0283 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	433 responses



Running Tests: Containers
Concurrency level: 3
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   7166      0 --:--:-- --:--:-- --:--:--  7166
hello:croot:/:hello:cbranch:/:hello:cleaf:/
Summary:
  Total:	10.0011 secs
  Slowest:	0.0060 secs
  Fastest:	0.0006 secs
  Average:	0.0009 secs
  Requests/sec:	3250.5477
  
  Total data:	1397887 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [31365]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [1123]	|■
  0.002 [7]	|
  0.003 [3]	|
  0.003 [1]	|
  0.004 [2]	|
  0.004 [1]	|
  0.005 [0]	|
  0.005 [3]	|
  0.006 [3]	|


Latency distribution:
  10% in 0.0008 secs
  25% in 0.0009 secs
  50% in 0.0009 secs
  75% in 0.0010 secs
  90% in 0.0010 secs
  95% in 0.0011 secs
  99% in 0.0013 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.0060 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0008 secs, 0.0006 secs, 0.0059 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	32509 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1810      0 --:--:-- --:--:-- --:--:--  1810
hello:croot:/busywork:hello:cbranch:/busywork:hello:cleaf:/busywork
Summary:
  Total:	10.0304 secs
  Slowest:	0.0472 secs
  Fastest:	0.0313 secs
  Average:	0.0322 secs
  Requests/sec:	93.0168
  
  Total data:	62511 bytes
  Size/request:	67 bytes

Response time histogram:
  0.031 [1]	|
  0.033 [916]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.034 [7]	|
  0.036 [1]	|
  0.038 [5]	|
  0.039 [0]	|
  0.041 [0]	|
  0.042 [2]	|
  0.044 [0]	|
  0.046 [0]	|
  0.047 [1]	|


Latency distribution:
  10% in 0.0318 secs
  25% in 0.0320 secs
  50% in 0.0322 secs
  75% in 0.0323 secs
  90% in 0.0325 secs
  95% in 0.0326 secs
  99% in 0.0351 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0313 secs, 0.0472 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0321 secs, 0.0312 secs, 0.0471 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	933 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2320      0 --:--:-- --:--:-- --:--:--  2320
hello:croot:/prime:hello:cbranch:/prime:hello:cleaf:/prime
Summary:
  Total:	10.0195 secs
  Slowest:	0.0359 secs
  Fastest:	0.0171 secs
  Average:	0.0227 secs
  Requests/sec:	132.2425
  
  Total data:	76850 bytes
  Size/request:	58 bytes

Response time histogram:
  0.017 [1]	|
  0.019 [154]	|■■■■■■■■■■■■■■■■■■■■■■
  0.021 [243]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [285]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [285]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.027 [226]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.028 [102]	|■■■■■■■■■■■■■■
  0.030 [18]	|■■■
  0.032 [6]	|■
  0.034 [4]	|■
  0.036 [1]	|


Latency distribution:
  10% in 0.0187 secs
  25% in 0.0202 secs
  50% in 0.0227 secs
  75% in 0.0248 secs
  90% in 0.0265 secs
  95% in 0.0274 secs
  99% in 0.0300 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0171 secs, 0.0359 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0013 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0225 secs, 0.0170 secs, 0.0358 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	1325 responses